# Tips DataFrame

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
tips = sns.load_dataset('tips')

#### Q: Display first 10 rows with total_bill , tip and day.

In [3]:
tips[['total_bill','tip','day']].head(10)

   total_bill   tip  day
0       16.99  1.01  Sun
1       10.34  1.66  Sun
2       21.01  3.50  Sun
3       23.68  3.31  Sun
4       24.59  3.61  Sun
5       25.29  4.71  Sun
6        8.77  2.00  Sun
7       26.88  3.12  Sun
8       15.04  1.96  Sun
9       14.78  3.23  Sun

#### Q.Display transactions related to lunch.

In [4]:
tips[tips['time'] == "Lunch"]

     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
78        22.76  3.00    Male     No  Thur  Lunch     2
79        17.29  2.71    Male     No  Thur  Lunch     2
80        19.44  3.00    Male    Yes  Thur  Lunch     2
81        16.66  3.40    Male     No  Thur  Lunch     2
..          ...   ...     ...    ...   ...    ...   ...
222        8.58  1.92    Male    Yes   Fri  Lunch     1
223       15.98  3.00  Female     No   Fri  Lunch     3
224       13.42  1.58    Male    Yes   Fri  Lunch     2
225       16.27  2.50  Female    Yes   Fri  Lunch     2
226       10.09  2.00  Female    Yes   Fri  Lunch     2

[68 rows x 7 columns]

#### Q.Display the summary information for total_bill and tip.

In [5]:
tips[['total_bill','tip']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
dtypes: float64(2)
memory usage: 3.9 KB

In [6]:
tips[['total_bill','tip']].describe()

       total_bill         tip
count  244.000000  244.000000
mean    19.785943    2.998279
std      8.902412    1.383638
min      3.070000    1.000000
25%     13.347500    2.000000
50%     17.795000    2.900000
75%     24.127500    3.562500
max     50.810000   10.000000

#### Q.Display average tip amount for male customers.

In [7]:
tips[tips.sex == 'Male'].tip.mean()

3.0896178343949052

#### Q.Display transactions where table size is 2,4 or 6.

In [8]:
tips[(tips['size']==2) | (tips['size']==4) | (tips['size']==6)]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
6          8.77  2.00    Male     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
237       32.83  1.17    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[197 rows x 7 columns]

#### Q.Display first 3 columns for first 10 rows.

In [9]:
tips.iloc[:10,:3]

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female
5       25.29  4.71    Male
6        8.77  2.00    Male
7       26.88  3.12    Male
8       15.04  1.96    Male
9       14.78  3.23    Male

#### Q.Display Count of transactions for each day.

In [10]:
(tips.day == 'Sun').sum()

76

In [11]:
(tips.day == 'Mon').sum()

0

In [12]:
(tips.day == 'Wed').sum()

0

In [13]:
(tips.day == 'Thur').sum()

62

In [14]:
(tips.day == 'Fri').sum()

19

In [15]:
(tips.day == 'Sat').sum()

87

#### Q.Display transactions where a day starts with 'S'.

In [16]:
tips[tips.day.str.startswith('S')]

     total_bill   tip     sex smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
1         10.34  1.66    Male     No  Sun  Dinner     3
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2
242       17.82  1.75    Male     No  Sat  Dinner     2

[163 rows x 7 columns]

#### Q.Display total_bill amount and tip amount.

In [17]:
tips[['total_bill','tip']].sum()

total_bill    4827.77
tip            731.58
dtype: float64

#### Q.Display the size of the table as small or large(small = 3 or less than 3, large = all others).

In [18]:
tips['size'].apply(lambda v : 'large' if v>3 else 'small')

0      small
1      small
2      small
3      small
4      large
       ...
239    small
240    small
241    small
242    small
243    small
Name: size, Length: 244, dtype: object

### Q.Display total_bill amount for each day.

In [19]:
tips.groupby(['day'])['total_bill'].sum()

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

### Q.Display total_tip amount for each day and smokers.

In [20]:
tips.groupby(['day','smoker'])['tip'].sum()

day   smoker
Thur  Yes        51.51
      No        120.32
Fri   Yes        40.71
      No         11.25
Sat   Yes       120.77
      No        139.63
Sun   Yes        66.82
      No        180.57
Name: tip, dtype: float64

### Q.Display total_bill and tip grouped by size.

In [21]:
tips.groupby(['size'])[['total_bill','tip']].sum()

      total_bill     tip
size
1          28.97    5.75
2        2565.89  402.84
3         884.55  128.94
4        1058.70  153.01
5         150.34   20.14
6         139.32   20.90

### Q.Average tip amount for each day for female.

In [22]:
tips.groupby(['sex'])['tip'].mean()

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

### Q.Maximum total bill for each day and each time.

In [23]:
tips.groupby(['day','time'])['total_bill'].max()

day   time
Thur  Lunch     43.11
      Dinner    18.78
Fri   Lunch     16.27
      Dinner    40.17
Sat   Lunch       NaN
      Dinner    50.81
Sun   Lunch       NaN
      Dinner    48.17
Name: total_bill, dtype: float64

#### Q.Display the total_bill for each day for each male and female.

In [24]:
tips.pivot_table(index='day',columns='smoker',aggfunc=sum,values = ['total_bill','tip'])

           tip         total_bill
smoker     Yes      No        Yes       No
day
Thur     51.51  120.32     326.24   770.09
Fri      40.71   11.25     252.20    73.68
Sat     120.77  139.63     893.62   884.78
Sun      66.82  180.57     458.28  1168.88

#### Q.Find out percentage of tip amount to total_bill amount.

# Countries (Rest Counties API) DataFrame

In [6]:
import pandas as pd

In [12]:
df = pd.read_json("https://restcountries.eu/rest/v2/all")

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 24 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            250 non-null    object
 1   topLevelDomain  250 non-null    object
 2   alpha2Code      250 non-null    object
 3   alpha3Code      250 non-null    object
 4   callingCodes    250 non-null    object
 5   capital         250 non-null    object
 6   altSpellings    250 non-null    object
 7   region          250 non-null    object
 8   subregion       250 non-null    object
 9   population      250 non-null    int64
 10  latlng          250 non-null    object
 11  demonym         250 non-null    object
 12  area            240 non-null    float64
 13  gini            153 non-null    float64
 14  timezones       250 non-null    object
 15  borders         250 non-null    object
 16  nativeName      250 non-null    object
 17  numericCode     249 non-null    float64
 18  currencies      250 non-null    object
 19  languages       250 non-null    object
 20  translations    250 non-null    object
 21  flag            250 non-null    object
 22  regionalBlocs   250 non-null    object
 23  cioc            247 non-null    object
dtypes: float64(3), int64(1), object(20)
memory usage: 47.0+ KB

### Q.How many Countries are there in each continent?

In [16]:
df.groupby('region')['name'].count()

region
             2
Africa      60
Americas    57
Asia        50
Europe      53
Oceania     27
Polar        1
Name: name, dtype: int64

### Q.Display the population of each continent?

In [38]:
df.groupby('region')['population'].sum()

region
                     0
Africa      1185705747
Americas     990317681
Asia        4386254784
Europe       746688182
Oceania       40169837
Polar             1000
Name: population, dtype: int64

### Q.Display the area of each continent?

In [39]:
df.groupby('region')['area'].sum()

region
                 461.00
Africa      30323491.00
Americas    42248044.36
Asia        32064971.00
Europe      23138282.46
Oceania      8515313.00
Polar       14000000.00
Name: area, dtype: float64

### Q.Display list of countries that start with letter 'I'.

In [40]:
for name in df['name']:
    if name.startswith('I'):
        print (name)

Iceland
India
Indonesia
Iran (Islamic Republic of)
Iraq
Ireland
Isle of Man
Israel
Italy

### Q.Display average population in each region?

In [42]:
df.groupby('region')['population'].mean()

region
            0.000000e+00
Africa      1.976176e+07
Americas    1.737399e+07
Asia        8.772510e+07
Europe      1.408846e+07
Oceania     1.487772e+06
Polar       1.000000e+03
Name: population, dtype: float64

### Q.Display which Country has highest population.

In [43]:
df[['name','population']].max()

name          Åland Islands
population       1377422166
dtype: object

### Q.Display Columns that have NULL Values.

In [69]:
df.isna().any()

name              False
topLevelDomain    False
alpha2Code        False
alpha3Code        False
callingCodes      False
capital           False
altSpellings      False
region            False
subregion         False
population        False
latlng            False
demonym           False
area               True
gini               True
timezones         False
borders           False
nativeName        False
numericCode        True
currencies        False
languages         False
translations      False
flag              False
regionalBlocs     False
cioc               True
dtype: bool

### Q.Display list of countries that have NULL values in 'area' column.

In [52]:
df[df['area'].isna()][['name','area']]

                                             name  area
33           United States Minor Outlying Islands   NaN
78                                  French Guiana   NaN
90                                     Guadeloupe   NaN
140                                    Martinique   NaN
143                                       Mayotte   NaN
171                           Palestine, State of   NaN
183                                       Réunion   NaN
188  Saint Helena, Ascension and Tristan da Cunha   NaN
209  South Georgia and the South Sandwich Islands   NaN
216                        Svalbard and Jan Mayen   NaN

In [ ]:
df.loc[df['area'].isnull(),['name','region']] # Alternate Solution

### Q.Display names of countries which have string length less than 5 characters.

In [70]:
df[df.name.str.len()<5]

,name,topLevelDomain,alpha2Code,alpha3Code,callingCodes,capital,altSpellings,region,subregion,population,...,timezones,borders,nativeName,numericCode,currencies,languages,translations,flag,regionalBlocs,cioc
46,Chad,[.td],TD,TCD,[235],N'Djamena,"[TD, Tchad, Republic of Chad, République du Tc...",Africa,Middle Africa,14497000,...,[UTC+01:00],"[CMR, CAF, LBY, NER, NGA, SSD]",Tchad,148.0,"[{'code': 'XAF', 'name': 'Central African CFA ...","[{'iso639_1': 'fr', 'iso639_2': 'fra', 'name':...","{'de': 'Tschad', 'es': 'Chad', 'fr': 'Tchad', ...",https://restcountries.eu/data/tcd.svg,"[{'acronym': 'AU', 'name': 'African Union', 'o...",CHA
58,Cuba,[.cu],CU,CUB,[53],Havana,"[CU, Republic of Cuba, República de Cuba]",Americas,Caribbean,11239004,...,[UTC-05:00],[],Cuba,192.0,"[{'code': 'CUC', 'name': 'Cuban convertible pe...","[{'iso639_1': 'es', 'iso639_2': 'spa', 'name':...","{'de': 'Kuba', 'es': 'Cuba', 'fr': 'Cuba', 'ja...",https://restcountries.eu/data/cub.svg,[],CUB
75,Fiji,[.fj],FJ,FJI,[679],Suva,"[FJ, Viti, Republic of Fiji, Matanitu ko Viti,...",Oceania,Melanesia,867000,...,[UTC+12:00],[],Fiji,242.0,"[{'code': 'FJD', 'name': 'Fijian dollar', 'sym...","[{'iso639_1': 'en', 'iso639_2': 'eng', 'name':...","{'de': 'Fidschi', 'es': 'Fiyi', 'fr': 'Fidji',...",https://restcountries.eu/data/fji.svg,[],FIJ
91,Guam,[.gu],GU,GUM,[1671],Hagåtña,"[GU, Guåhån]",Oceania,Micronesia,184200,...,[UTC+10:00],[],Guam,316.0,"[{'code': 'USD', 'name': 'United States dollar...","[{'iso639_1': 'en', 'iso639_2': 'eng', 'name':...","{'de': 'Guam', 'es': 'Guam', 'fr': 'Guam', 'ja...",https://restcountries.eu/data/gum.svg,[],GUM
108,Iraq,[.iq],IQ,IRQ,[964],Baghdad,"[IQ, Republic of Iraq, Jumhūriyyat al-‘Irāq]",Asia,Western Asia,37883543,...,[UTC+03:00],"[IRN, JOR, KWT, SAU, SYR, TUR]",العراق,368.0,"[{'code': 'IQD', 'name': 'Iraqi dinar', 'symbo...","[{'iso639_1': 'ar', 'iso639_2': 'ara', 'name':...","{'de': 'Irak', 'es': 'Irak', 'fr': 'Irak', 'ja...",https://restcountries.eu/data/irq.svg,"[{'acronym': 'AL', 'name': 'Arab League', 'oth...",IRQ
137,Mali,[.ml],ML,MLI,[223],Bamako,"[ML, Republic of Mali, République du Mali]",Africa,Western Africa,18135000,...,[UTC],"[DZA, BFA, GIN, CIV, MRT, NER, SEN]",Mali,466.0,"[{'code': 'XOF', 'name': 'West African CFA fra...","[{'iso639_1': 'fr', 'iso639_2': 'fra', 'name':...","{'de': 'Mali', 'es': 'Mali', 'fr': 'Mali', 'ja...",https://restcountries.eu/data/mli.svg,"[{'acronym': 'AU', 'name': 'African Union', 'o...",MLI
163,Niue,[.nu],NU,NIU,[683],Alofi,[NU],Oceania,Polynesia,1470,...,[UTC-11:00],[],Niuē,570.0,"[{'code': 'NZD', 'name': 'New Zealand dollar',...","[{'iso639_1': 'en', 'iso639_2': 'eng', 'name':...","{'de': 'Niue', 'es': 'Niue', 'fr': 'Niue', 'ja...",https://restcountries.eu/data/niu.svg,[],
168,Oman,[.om],OM,OMN,[968],Muscat,"[OM, Sultanate of Oman, Salṭanat ʻUmān]",Asia,Western Asia,4420133,...,[UTC+04:00],"[SAU, ARE, YEM]",عمان,512.0,"[{'code': 'OMR', 'name': 'Omani rial', 'symbol...","[{'iso639_1': 'ar', 'iso639_2': 'ara', 'name':...","{'de': 'Oman', 'es': 'Omán', 'fr': 'Oman', 'ja...",https://restcountries.eu/data/omn.svg,"[{'acronym': 'AL', 'name': 'Arab League', 'oth...",OMA
175,Peru,[.pe],PE,PER,[51],Lima,"[PE, Republic of Peru, República del Perú]",Americas,South America,31488700,...,[UTC-05:00],"[BOL, BRA, CHL, COL, ECU]",Perú,604.0,"[{'code': 'PEN', 'name': 'Peruvian sol', 'symb...","[{'iso639_1': 'es', 'iso639_2': 'spa', 'name':...","{'de': 'Peru', 'es': 'Perú', 'fr': 'Pérou', 'j...",https://restcountries.eu/data/per.svg,"[{'acronym': 'PA', 'name': 'Pacific Alliance',...",PER
226,Togo,[.tg],TG,TGO,[228],Lomé,"[TG, Togolese, Togolese Republic, République T...",Africa,Western Africa,7143000,...,[UTC],"[BEN, BFA, GHA]",Togo,768.0,"[{'code': 'XOF', 'name': 'West African CFA fra...","[{'iso639_1': 'fr', 'iso639_2': 'fra', 'name':...","{'de': 'Togo', 'es': 'Togo', 'fr': 'Togo', 'ja...",https://restcountries.eu/data/tgo.svg,"[{'acronym': 'AU', 'name': 'African Union', 'o...",TOG